app/controllers/adventures_controller.rb

    def index
        adventures = Adventure.all
---
SELECT "adventures".* FROM "adventures"

    def show
        adventure = Adventure.find(params[:id])
---
SELECT "adventures".* FROM "adventures" WHERE "adventures"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

    def create
        adventure = Adventure.create(adventure_params)
---
INSERT INTO "adventures" ("created_at", "updated_at") VALUES ($1, $2) RETURNING "id"  [["created_at", "2021-04-02 03:33:27.259658"], ["updated_at", "2021-04-02 03:33:27.259658"]]

    def update
        adventure = Adventure.find(params[:id])
        adventure.update(description: (params[:description]))
        adventure.update(likes: (params[:likes]))
---
SELECT "adventures".* FROM "adventures" WHERE "adventures"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "adventures" SET "description" = $1, "updated_at" = $2 WHERE "adventures"."id" = $3  [["description", nil], ["updated_at", "2021-03-31 18:37:24.958649"], ["id", 1]]
UPDATE "adventures" SET "likes" = $1, "updated_at" = $2 WHERE "adventures"."id" = $3  [["likes", nil], ["updated_at", "2021-03-31 18:37:25.057981"], ["id", 1]]

    def destroy
        adventure = Adventure.find(params[:id])
        adventure.destroy
---
SELECT "adventures".* FROM "adventures" WHERE "adventures"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "adventures" WHERE "adventures"."id" = $1  [["id", 1]]