app/controllers/comments_controller.rb

SELECT "comments".* FROM "comments"
---
    def index
        comments = Comment.all