app/controllers/users_controller.rb

INSERT INTO "users" ("name", "hometown", "bio", "age", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "OnlyPans"], ["hometown", "Seattle"], ["bio", "Software engineer at google "], ["age", 6], ["created_at", "2021-04-02 03:42:53.307270"], ["updated_at", "2021-04-02 03:42:53.307270"]]
---
    def create
        user = User.find_or_create_by(user_params)